### Etapa 1

- Projeto desafio 1: vendas online
Lemos a base de dados no desafio anterior, agora podemos avançar nas transformações desses dados. Então, o novo desafio do projeto 1 será dividido em algumas metas:

- [x] Remover os dados em listas dentro do DataFrame;
- [x] Verificar os tipos de dados;
- [x] Identificar colunas numéricas;
- [x] Transformar a coluna numérica para o tipo numérico.

In [129]:
from http import HTTPStatus

import requests

import pandas as pd

#### 1 - Remover os dados em listas dentro do DataFrame

In [130]:
r = requests.get('https://cdn3.gnarususercontent.com.br/2928-transformacao-manipulacao-dados/dados_vendas_clientes.json')

if r.status_code == HTTPStatus.OK:
  df = pd.DataFrame(r.json())
  df = pd.json_normalize(df['dados_vendas'])


df.head()

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","[R$ 836,5, R$ 573,33, R$ 392,8, R$ 512,34]"
1,07/06/2022,"[Isabely JOanes 738, Isabely JOanes 738, Isabe...","[R$ 825,31, R$ 168,07, R$ 339,18, R$ 314,69]"
2,08/06/2022,"[Isabely JOanes 738, JOãO Gabriel 671, Julya m...","[R$ 682,05, R$ 386,34, R$ 622,65, R$ 630,79]"
3,09/06/2022,"[Julya meireles 914, MaRIA Julia 444, MaRIA Ju...","[R$ 390,3, R$ 759,16, R$ 334,47, R$ 678,78]"
4,10/06/2022,"[MaRIA Julia 444, PEDRO PASCO 812, Paulo castr...","[R$ 314,24, R$ 311,15, R$ 899,16, R$ 885,24]"

#### 2 - Verificar os tipos de dados

In [131]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    5 non-null      object
 1   Cliente          5 non-null      object
 2   Valor da compra  5 non-null      object
dtypes: object(3)
memory usage: 252.0+ bytes

#### 3 - Identificar colunas numéricas;

In [132]:
# Valor de compra é um valor númerico

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    5 non-null      object
 1   Cliente          5 non-null      object
 2   Valor da compra  5 non-null      object
dtypes: object(3)
memory usage: 252.0+ bytes

#### 4 - Transformar a coluna numérica para o tipo numérico.

In [133]:
df = df.explode('Valor da compra')

df.reset_index(drop=True, inplace=True)

df['Valor da compra'] = df['Valor da compra'].map(lambda v: v.replace('R$', '').replace(',', '').strip())


df['Valor da compra'] = df['Valor da compra'].astype('float32')

df['Valor da compra'].dtype

dtype('float32')

### Etapa 2

- Projeto desafio 2: administração de condomínios

Lemos a base de dados no desafio anterior, agora podemos avançar nas transformações desses dados. Então, da mesma forma que o projeto 1, o desafio do projeto 2 está listado em algumas metas:


- [x] Remover os dados em listas dentro do DataFrame;
- [x] Verificar os tipos de dados;
- [x] Identificar colunas numéricas;
- [x] Transformar a coluna numérica para o tipo numérico.

In [134]:
r = requests.get('https://cdn3.gnarususercontent.com.br/2928-transformacao-manipulacao-dados/dados_locacao_imoveis.json')


if r.status_code == HTTPStatus.OK:

  df = pd.DataFrame(r.json())
  df = pd.json_normalize(df['dados_locacao'])

df

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel
0,A101 (blocoAP),"[01/06/2022, 01/07/2022]","[05/06/2022, 03/07/2022]","[$ 1000,0 reais, $ 2500,0 reais]"
1,A102 (blocoAP),"[02/06/2022, 02/07/2022]","[02/06/2022, 06/07/2022]","[$ 1100,0 reais, $ 2600,0 reais]"
2,B201 (blocoAP),"[03/06/2022, 03/07/2022]","[07/06/2022, 03/07/2022]","[$ 1200,0 reais, $ 2700,0 reais]"
3,B202 (blocoAP),"[04/06/2022, 04/07/2022]","[07/06/2022, 05/07/2022]","[$ 1300,0 reais, $ 2800,0 reais]"
4,C301 (blocoAP),"[05/06/2022, 05/07/2022]","[10/06/2022, 09/07/2022]","[$ 1400,0 reais, $ 2900,0 reais]"
5,C302 (blocoAP),"[06/06/2022, 06/07/2022]","[08/06/2022, 12/07/2022]","[$ 1500,0 reais, $ 1200,0 reais]"
6,D401 (blocoAP),"[07/06/2022, 07/07/2022]","[07/06/2022, 09/07/2022]","[$ 1600,0 reais, $ 1300,0 reais]"
7,D402 (blocoAP),"[08/06/2022, 08/07/2022]","[10/06/2022, 14/07/2022]","[$ 1700,0 reais, $ 1400,0 reais]"
8,E501 (blocoAP),"[09/06/2022, 09/07/2022]","[10/06/2022, 09/07/2022]","[$ 1800,0 reais, $ 1500,0 reais]"
9,E502 (blocoAP),"[10/06/2022, 10/07/2022]","[16/06/2022, 12/07/2022]","[$ 1900,0 reais, $ 1600,0 reais]"
10,F601 (blocoAP),"[11/06/2022, 11/07/2022]","[17/06/2022, 13/07/2022]","[$ 2000,0 reais, $ 1000,0 reais]"
11,F602 (blocoAP),"[12/06/2022, 12/07/2022]","[15/06/2022, 12/07/2022]","[$ 2100,0 reais, $ 1100,0 reais]"
12,G701 (blocoAP),"[13/06/2022, 13/07/2022]","[19/06/2022, 20/07/2022]","[$ 2200,0 reais, $ 1200,0 reais]"
13,G702 (blocoAP),"[14/06/2022, 14/07/2022]","[15/06/2022, 17/07/2022]","[$ 2300,0 reais, $ 2100,0 reais]"
14,H801 (blocoAP),"[15/06/2022, 15/07/2022]","[18/06/2022, 16/07/2022]","[$ 2400,0 reais, $ 2200,0 reais]"

#### 1 - Remover os dados em listas dentro do DataFrame

In [135]:
df = df.explode('datas_combinadas_pagamento')
df = df.explode('datas_de_pagamento')
df = df.explode('valor_aluguel')

df.reset_index(drop=True, inplace=True)

df

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel
0,A101 (blocoAP),01/06/2022,05/06/2022,"$ 1000,0 reais"
1,A101 (blocoAP),01/06/2022,05/06/2022,"$ 2500,0 reais"
2,A101 (blocoAP),01/06/2022,03/07/2022,"$ 1000,0 reais"
3,A101 (blocoAP),01/06/2022,03/07/2022,"$ 2500,0 reais"
4,A101 (blocoAP),01/07/2022,05/06/2022,"$ 1000,0 reais"
...,...,...,...,...
115,H801 (blocoAP),15/06/2022,16/07/2022,"$ 2200,0 reais"
116,H801 (blocoAP),15/07/2022,18/06/2022,"$ 2400,0 reais"
117,H801 (blocoAP),15/07/2022,18/06/2022,"$ 2200,0 reais"
118,H801 (blocoAP),15/07/2022,16/07/2022,"$ 2400,0 reais"
119,H801 (blocoAP),15/07/2022,16/07/2022,"$ 2200,0 reais"

#### 2 - Verificar os tipos de dados

In [136]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   apartamento                 120 non-null    object
 1   datas_combinadas_pagamento  120 non-null    object
 2   datas_de_pagamento          120 non-null    object
 3   valor_aluguel               120 non-null    object
dtypes: object(4)
memory usage: 3.9+ KB

#### 3. Identificar colunas numéricas

In [137]:
df['valor_aluguel']

0      $ 1000,0 reais
1      $ 2500,0 reais
2      $ 1000,0 reais
3      $ 2500,0 reais
4      $ 1000,0 reais
            ...
115    $ 2200,0 reais
116    $ 2400,0 reais
117    $ 2200,0 reais
118    $ 2400,0 reais
119    $ 2200,0 reais
Name: valor_aluguel, Length: 120, dtype: object

#### 4. Transformar a coluna numérica para o tipo numérico

In [138]:
df['valor_aluguel'] = df['valor_aluguel'].map(lambda v: v.replace('$', '').replace(',', '').replace('reais', '').strip())
df['valor_aluguel'] = df['valor_aluguel'].astype('float64')

df['valor_aluguel'].dtype

dtype('float64')